examples/openfoam/example_icoFoamYadeMPI/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/* transportModel Newtonian; */ 

nu              [0 2 -1 0 0 0 0] 1e-04;
partDensity     [1 -3 0 0 0 0 0] 2000; 
fluidDensity    [1 -3 0 0 0 0 0] 1000; 


// ************************************************************************* //
